function checkLength(string, maxLengh){
  return string.length <= maxLengh;
}
checkLength('asd',4);

function getRandomInt(min, max) {
  min = Math.ceil(min);
  max = Math.floor(max);
  return Math.floor(Math.random() * (max - min)) + min; //Максимум не включается, минимум включается
}

//25 сгенерированных объектов
const COUNT_OBJECT = 25;
//Структура каждого объекта должна быть следующей:

//id число от 1 до 25

//url photos/{{i}}.jpg где {{i}} — это число от 1 до 25. Адреса картинок не должны повторяться.

//description  строка — описание фотографии. Описание придумайте самостоятельно.

//likes, число — количество лайков, поставленных фотографии. Случайное число от 15 до 200.

//comments , массив объектов — список комментариев, оставленных другими пользователями к этой фотографии. 
//Количество комментариев к каждой фотографии вы определяете на своё усмотрение. Все комментарии генерируются случайным образом. Пример описания объекта с комментарием:
/*
{
  id: 135,
  avatar: 'img/avatar-6.svg',
  message: 'В целом всё неплохо. Но не всё.',
  name: 'Артём',
}
*/
let object = {
  id: 1,
  url: "photos/2.jpg",
  description: "какое-то описание",
  likes: 25,
  comments:[
    {
      id: 3,
      avatar: "img/avatar-6.svg",
      message: 'В целом всё неплохо. Но не всё.',
      name: "ads",
    },
    {
      id: 4,
      avatar: "img/avatar-7.svg",
      message: 'В целом всё неплохо. Но не всё.',
      name: "ads",
    }
  ]
}

/*
У каждого комментария есть идентификатор — id — случайное число. Идентификаторы не должны повторяться.

Поле avatar — это строка, значение которой формируется по правилу img/avatar-{{случайное число от 1 до 6}}.svg. Аватарки подготовлены в директории img.

Для формирования текста комментария — message — вам необходимо взять одно или два случайных предложения из представленных ниже:
*/
const TXT_MESSAGE = `Всё отлично!
В целом всё неплохо. 
Но не всё.
Когда вы делаете фотографию, хорошо бы убирать палец из кадра. В конце концов это просто непрофессионально.
Моя бабушка случайно чихнула с фотоаппаратом в руках и у неё получилась фотография лучше.
Я поскользнулся на банановой кожуре и уронил фотоаппарат на кота и у меня получилась фотография лучше.
Лица у людей на фотке перекошены, как будто их избивают. Как можно было поймать такой неудачный момент?!`;
const ARR_TXT = TXT_MESSAGE.split('\n');


//Имена авторов также должны быть случайными. Набор имён для комментаторов составьте сами. Подставляйте случайное имя в поле name.

const NAME = ['Федя', 'Мария', 'Константин', 'Марина', 'Светлана', 'Виктория', 'Игорь', 'Василий', 'Василиса', 'Нина'];